//給指法要輸出一串音符後手指按了幾下，注意如果沒放開就不算按(非計算所有音符中指頭出現在指法內的總次數)
//有指法->刻表
//注意有空字串，一定得用getline，不能用cin
//透過觀察可發現，指法完全不用動到指頭5和6，要省空間可以少刻2指的指法
#include <iostream>
#include <vector>
#include <string>
#include <map>
using namespace std;

int main(){
    map<char, vector<bool>> m={{'c', {0, 1, 1, 1, 0, 0, 1, 1, 1, 1}},   //指法表
                               {'d', {0, 1, 1, 1, 0, 0, 1, 1, 1, 0}},
                               {'e', {0, 1, 1, 1, 0, 0, 1, 1, 0, 0}},
                               {'f', {0, 1, 1, 1, 0, 0, 1, 0, 0, 0}},
                               {'g', {0, 1, 1, 1, 0, 0, 0, 0, 0, 0}},
                               {'a', {0, 1, 1, 0, 0, 0, 0, 0, 0, 0}},
                               {'b', {0, 1, 0, 0, 0, 0, 0, 0, 0, 0}},
                               {'C', {0, 0, 1, 0, 0, 0, 0, 0, 0, 0}},
                               {'D', {1, 1, 1, 1, 0, 0, 1, 1, 1, 0}},
                               {'E', {1, 1, 1, 1, 0, 0, 1, 1, 0, 0}},
                               {'F', {1, 1, 1, 1, 0, 0, 1, 0, 0, 0}},
                               {'G', {1, 1, 1, 1, 0, 0, 0, 0, 0, 0}},
                               {'A', {1, 1, 1, 0, 0, 0, 0, 0, 0, 0}},
                               {'B', {1, 1, 0, 0, 0, 0, 0, 0, 0, 0}}, 
                               };
    int t;  //測資數
    if(!(cin >> t)) return 0;
    cin.ignore();   //cin接getline
    while(t--){
        vector<int> times(10);  //儲存各指頭按下幾次
        vector<bool> last(10);  //儲存上一音符的指法，一開始初始化是全0
        string s;
        getline(cin, s);
        if(s.empty()){          //空字串要直接輸出全都0次
            cout << "0 0 0 0 0 0 0 0 0 0" << endl; 
            continue;
        }   
        for(char &c : s){       
            for(size_t i=0;i<10;i++){   //比對上一音符與此次音符的各個指頭狀態
                if(!last[i] && m[c][i]) times[i]++; //唯上一音符沒按且此次音符要按才算按一次
                last[i]=m[c][i];    //更新上一音符
            }
        }
        for(size_t i=0;i<10;i++){
            cout << times[i] << ' ';    //輸出
        }
        cout << endl;
    }
}