//此題要將符號解碼成其在鍵盤上左邊2個的符號，沒什麼技術含量，就是建表久了些
#include <iostream>
#include <map>
#include <string>
using namespace std;

int main(){ 
    map<char, char> decoder={{' ',' '}, {'e','q'}, {'d','a'}, {'c','z'}, {'r','w'}, {'f','s'},  //表，注意英數和其他符號只要符合條件就要放進來
                            {'v','x'}, {'t','e'}, {'g','d'}, {'b','c'}, {'y','r'}, {'h','f'},
                            {'n','v'}, {'u','t'}, {'j','g'}, {'m','b'}, {'i','y'}, {'k','h'},
                            {',','n'}, {'o','u'}, {'l','j'}, {'.','m'}, {'p','i'}, {';','k'},
                            {'/',','}, {'[','o'}, {'\'','l'}, {']','p'}, {'2','`'}, {'3','1'}, 
                            {'4','2'}, {'5','3'}, {'6','4'}, {'7','5'}, {'8','6'},{'9','7'}, 
                            {'0','8'}, {'-','9'}, {'=','0'}, {'\\','['} 
                        };
    string str;
    while(getline(cin,str)){
        for(char &c : str){         //遍歷密碼字元轉成對應的字元
            cout << decoder[c];
        }
        cout << endl;
    }
}