//此題能借空瓶，但也要還回去(一般遞迴的變形)
/*
法1(數學公式法):
集K瓶空瓶能換一瓶可樂+空瓶 -> K瓶子=1瓶子+1可樂 -> 1可樂=K-1空瓶
最多能喝N(起初有的可樂瓶數)+floor((N/K-1))(用換的可樂瓶數)=floor((KN-N+N)/(K-1))=floor(NK/K-1)
證明:
起初有N瓶可樂，要借X瓶使得額外多喝Y瓶
I.N+X=K*Y (自己有的+借的總數=能換的總數)
II.X=Y (最後剩Y瓶空瓶，當作要還回去的 ; 若X>Y:Y空瓶不夠還回去 ; 若X<Y:最後自己留有空瓶，但還能繼續借繼續換)
解聯立得到Y=N/(K-1) (若Y非整數代表自己留了沒辦法再換下去的空瓶)
*/
/*
法2(迴圈/遞迴法) (此處我用迴圈實作):
令當輪有N'瓶空瓶，則換一輪後剩下的空瓶為N'/K(換來的新可樂)+N'%K(沒換掉的空瓶)
故換一輪後有前面喝過的sum瓶+這輪換到的N'/K瓶可樂
直到N'不夠K瓶，要借才能再換更多
但只有N'==K-1時才能借來換，不然會還不起(K-2甚至更小借來換最後都只剩1瓶)，故如果符合sum再加1瓶
*/
#include <iostream>
using namespace std;

int main(){
    int N;
    const int K=3;
    while(cin >> N){
        //法1
        cout << N*K/(K-1) << endl;  

        //法2
        /* 
        long long sum=N;
        while(N>=K){
            sum+=N/K;
            N=N/K+N%K;
        }
        if(N==K-1) sum++;
        cout << sum << endl;
        */       
    }
}